#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.5`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mtime_sleep.sleep_kusto_db["operationaldb"]: Refreshing state... [id=2024-09-18T21:46:46Z][0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-stg-rg][0m
[0m[1mazurerm_resource_group.resource_group_dataeng: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hZTFjOWZiMy03YmM5LTQ0MDMtYjM5MS1hZWJmYTA2NGJlMWU7b2JqZWN0SWQ9N2I1NzNmOWEtM2EyOC00OWM3LWI3NTUtNjUwMjBmNTA4OGU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-stg-rg/providers/Microsoft.Storage/storageAccounts/tsdeintstg001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.KeyVault/vaults/tsde-int-vault001][0m
[0m[1mazurerm_kusto_cluster.kusto_cluster: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.DataFactory/factories/tsde-int-df001][0m
[0m[1mdata.azurerm_location.current: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/locations/germanywestcentral][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Reading...[0m[0m
[0m[1mazurerm_kusto_database.kusto_database["operationaldb"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001/databases/operationaldb][0m
[0m[1mazurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoint_kusto_cluster: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.DataFactory/factories/tsde-int-df001/managedVirtualNetworks/default/managedPrivateEndpoints/AzureDataExplorer][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_admin["operationaldb"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001/databases/operationaldb/principalAssignments/operationaldb-Admin-tsde-int-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_ingestor["operationaldb"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001/databases/operationaldb/principalAssignments/operationaldb-Ingestor-tsde-int-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_viewer["operationaldb"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001/databases/operationaldb/principalAssignments/operationaldb-Viewer-tsde-int-df001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001][0m
[0m[1mazurerm_kusto_script.kusto_script["operationaldb"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.Kusto/clusters/tsde-int-kusto001/databases/operationaldb/scripts/init-db-operationaldb][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.KeyVault/vaults/tsde-int-vault001/providers/Microsoft.Authorization/roleAssignments/336330d1-2fb4-b38a-a5e0-b15b4262097e][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.KeyVault/vaults/tsde-int-vault001/providers/Microsoft.Authorization/roleAssignments/67cd1ec8-6c39-39a7-f881-7d95a900d1c0][0m
[0m[1mazurerm_role_assignment.current_role_assignment_storage: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-stg-rg/providers/Microsoft.Storage/storageAccounts/tsdeintstg001/providers/Microsoft.Authorization/roleAssignments/b0e931f2-ac5a-46c7-56c3-62195b8469c0][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Reading...[0m[0m
[0m[1mazurerm_storage_container.storage_container["raw"]: Refreshing state... [id=https://tsdeintstg001.blob.core.windows.net/raw][0m
[0m[1mazurerm_storage_container.storage_container["upload-iptv"]: Refreshing state... [id=https://tsdeintstg001.blob.core.windows.net/upload-iptv][0m
[0m[1mazurerm_storage_container.storage_container["upload-ott"]: Refreshing state... [id=https://tsdeintstg001.blob.core.windows.net/upload-ott][0m
[0m[1mazurerm_storage_container.storage_container["curated"]: Refreshing state... [id=https://tsdeintstg001.blob.core.windows.net/curated][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_storage: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-stg-rg/providers/Microsoft.Storage/storageAccounts/tsdeintstg001/providers/Microsoft.Authorization/roleAssignments/06c3217f-ca8a-907f-8287-71968669de9b][0m
[0m[1mazurerm_storage_container.storage_container["logs"]: Refreshing state... [id=https://tsdeintstg001.blob.core.windows.net/logs][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.KeyVault/vaults/tsde-int-vault001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-stg-rg/providers/Microsoft.Storage/storageAccounts/tsdeintstg001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.DataFactory/factories/tsde-int-df001"
    }

[1m  # azurerm_data_factory.data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory" "data_factory" {
        id                               = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tsde-int-dataeng-rg/providers/Microsoft.DataFactory/factories/tsde-int-df001"
        name                             = "tsde-int-df001"
        tags                             = {}
        [90m# (7 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m global_parameter {
          [31m-[0m[0m name  = "minimumLift" [90m-> null[0m[0m
          [31m-[0m[0m type  = "Float" [90m-> null[0m[0m
          [31m-[0m[0m value = "5" [90m-> null[0m[0m
        }
      [31m-[0m[0m global_parameter {
          [31m-[0m[0m name  = "minimumNumberOfUsersPerWindow" [90m-> null[0m[0m
          [31m-[0m[0m type  = "Float" [90m-> null[0m[0m
          [31m-[0m[0m value = "10" [90m-> null[0m[0m
        }
      [31m-[0m[0m global_parameter {
          [31m-[0m[0m name  = "minimumPlays" [90m-> null[0m[0m
          [31m-[0m[0m type  = "Float" [90m-> null[0m[0m
          [31m-[0m[0m value = "20" [90m-> null[0m[0m
        }
      [31m-[0m[0m global_parameter {
          [31m-[0m[0m name  = "movingWindowInMinutes" [90m-> null[0m[0m
          [31m-[0m[0m type  = "Float" [90m-> null[0m[0m
          [31m-[0m[0m value = "30" [90m-> null[0m[0m
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumLift"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "5.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumNumberOfUsersPerWindow"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "10.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumPlays"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "20.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "movingWindowInMinutes"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "30.0"
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>